package com.offke.core.bu.exception;

/**
 * 系统参数索引定义
 *
 * @version 1.0
 * @since 2012/6/5
 */
public interface RSysparas {
    int _结算日期 = 2;
    int _RSA2101 = 2101;
    int _RSA2102 = 2102;
    int _移动IP = 2104;
    int _移动端口 = 2105;
    int _移动DRTP = 2106;
    int _移动功能号 = 2107;
    int _移动服务器对账文件路径 = 2108;
    int _水控费率1 = 2201;
    int _水控费率2 = 2202;
    int _水控费率3 = 2203;
    int _电控服务器ip = 2301;
    int _电控服务器port = 2302;
    int _电控转账对应的drtp节点号 = 2303;
    int _电控转账对应的前置主功能号 = 2304;
    int _下载文件目录 = 2305;
    int _上传文件目录 = 2306;
    int _v2常工电控转账对应的drtp节点号 = 2501;
    int _v2常工电控转账对应的前 = 2502;
    int _校区编号 = 2999;
    int _水控钱包上限 = 3001;
    int _水价 = 3002;
    int _水表号上限 = 3003;
    int _是否判断卡位图入账 = 202;
    int _日结标志 = 1;
    int _POS机工作模式 = 3;
    int _挂失后补办_销户天数 = 4;
    int _自动平帐最大金额 = 5;
    int _前置机版本号 = 6;
    int _银行卡是否联机绑定模式 = 7;
    int _ = 8;
    int _无条件查询最大条数 = 9;
    int _搭伙费收取模式 = 10;
    int _黑名单最大版本号 = 11;
    int _最大卡名单版本号 = 12;
    int _是否启用卡片库存管理 = 13;
    int _临时卡客户类别 = 14;
    int _机构名 = 15;
    int _单笔补助金额上限 = 16;
    int _退卡允许金额上限 = 17;
    int _下发补助是否需要审核 = 18;
    int _是否广播黑名单 = 20;
    int _单次消费限额 = 21;
    int _日消费限额 = 22;
    int _正式卡张数 = 23;
    int _补助模式 = 24;
    int _用户编号 = 25;
    int _应用ID号 = 26;
    int _索亚门禁支持的最大卡片数量 = 27;
    int _单笔充值最大金额 = 28;
    int _水控消费最大金额 = 30;
    int _后付费锁卡时记录终端号类型 = 31;
    int _水控费率157 = 157;
    int _水控费率158 = 158;
    int _水控费率159 = 159;
    int _电子钱包是否允许透支 = 201;
    int _可冲正历史流水最长时间 = 1108;
    int _前置机CCU侦听端口 = 1200;
    int _CCUFTP用户名 = 1701;
    int _CCUFTP密码 = 1702;
    int _CCUFTP端口号 = 1703;
    int _设备授权密钥 = 2006;
    int _65类卡密钥 = 2007;
    int _小钱包密钥 = 2009;
    int _水控钱包号 = 2010;
    int _RSA2100 = 2100;

    /* add by xiujuan.kong at 2012-10-12 */
    int _餐补客户类型 = 5000;
    int _餐补领取有效天数 = 5001;
    int _餐补单笔金额 = 5002;
    int _餐补最大金额 = 5003;
    int _餐补生成日 = 5004;
    int _餐补日结操作 = 5005;
    /* end */

}
